{
  "preamble": {
    "title": "Préambule",
    "content": "Le Peuple Malagasy souverain,\r\n\r\nAffirmant sa croyance en Andriamanitra Andriananahary,\r\n\r\nRésolu à promouvoir et à développer son héritage de société vivant en harmonie et respectueuse de l’altérité, de la richesse et du dynamisme de ses valeurs culturelles et spirituelles à travers le « fanahy maha-olona »,\r\n\r\nConvaincu de la nécessité pour la société malagasy de retrouver son originalité, son authenticité et sa malgachéité, et de s’inscrire dans la modernité du millénaire tout en conservant ses valeurs et principes fondamentaux traditionnels basés sur le fanahy malagasy qui comprend « ny fitiavana, ny fihavanana, ny fifanajàna, ny fitandroana ny aina », et privilégiant un cadre de vie permettant un « vivre ensemble » sans distinction de région, d’origine, d’ethnie, de religion, d’opinion politique, ni de sexe,\r\n\r\nConscient qu’il est indispensable de mettre en oeuvre un processus de réconciliation nationale,\r\n\r\nConvaincu que le Fokonolona, organisé en Fokontany, constitue un cadre de vie, d’émancipation, d’échange et de concertation participative des citoyens,\r\n\r\nPersuadé de l’importance exceptionnelle des richesses de la faune, de la flore et des ressources minières à fortes spécificités dont la nature a doté Madagascar, et qu’il importe de préserver pour les générations futures,\r\n\r\nConstatant que le non-respect de la Constitution ou sa révision en vue de renforcer le pouvoir des gouvernants au détriment des intérêts de la population sont les causes des crises cycliques,\r\n\r\nConsidérant la situation géopolitique de Madagascar et sa participation volontariste dans le concert des nations, et faisant siennes, notamment :\r\n\r\n- La Charte internationale des droits de l’homme ;\r\n\r\n- Les Conventions relatives aux droits de l’enfant, aux droits de la femme, à la protection de l’environnement, aux droits sociaux, économiques, politiques, civils et culturels,\r\n\r\nConsidérant que l’épanouissement de la personnalité et de l’identité de tout Malagasy est le facteur essentiel du développement durable et intégré dont les conditions sont, notamment :\r\n\r\n- la préservation de la paix, la pratique de la solidarité et le devoir de préservation de l’unité nationale dans la mise en œuvre d’une politique de développement équilibré et harmonieux;\r\n\r\n- le respect et la protection des libertés et droits fondamentaux ;\r\n\r\n- l’instauration d’un État de droit en vertu duquel les gouvernants et les gouvernés sont soumis aux mêmes normes juridiques, sous le contrôle d’une Justice indépendante ;\r\n\r\n- l’élimination de toutes les formes d’injustice, de corruption, d’inégalité et de discrimination ;\r\n\r\n- la gestion rationnelle et équitable des ressources naturelles pour les besoins du développement de l’être humain ;\r\n\r\n- la bonne gouvernance dans la conduite des affaires publiques, grâce à la transparence dans la gestion et la responsabilisation des dépositaires de la puissance publique ;\r\n\r\n- la séparation et l’équilibre des pouvoirs exercés à travers les procédés démocratiques ;\r\n\r\n- la mise en oeuvre de la décentralisation effective, par l’octroi de la plus large autonomie aux collectivités décentralisées tant au niveau des compétences que des moyens financiers ;\r\n\r\n- la préservation de la sécurité humaine.\r\n\r\nDéclare :"
  },
  "headlines": [
    {
      "title": "Titre I. Des principes fondamentaux.",
      "range": "Art.1-Art.6",
      "articles": [
        {
          "id": 1,
          "title": "Article 1",
          "content": "Le Peuple Malagasy constitue une Nation organisée en Etat souverain, unitaire, républicain et laïc.\nCet Etat porte le nom de « République de Madagascar ».\nLa démocratie et le principe de l'Etat de droit constituent le fondement de la République.\nSa souveraineté s’exerce dans les limites de son territoire.\nNul ne peut porter atteinte à l'intégrité territoriale de la République.\nLe territoire national est inaliénable.\nLes modalités et les conditions relatives à la vente de terrain et au bail emphytéotique au profit des étrangers sont déterminées par la loi."
        },
        {
          "id": 2,
          "title": "Article 2",
          "content": "L' Etat affirme sa neutralité à l'égard des différentes religions.\nLa laïcité de la République repose sur le principe de la séparation des affaires de l'Etat et des institutions religieuses et de leurs représentants.\nL' Etat et les institutions religieuses s’interdisent toute immixtion dans leurs domaines respectifs.\nAucun Chef d’Institution ni membre de Gouvernement ne peuvent faire partie des instances dirigeantes d’une Institution religieuse, sous peine d’être déchu par la Haute Cour Constitutionnelle ou d’être démis d’office de son mandat ou de sa fonction."
        },
        {
          "id": 3,
          "title": "Article 3",
          "content": "La République de Madagascar est un Etat reposant sur un système de Collectivités Territoriales Décentralisées composées de Communes, de Régions et des Provinces dont les compétences et les principes d’autonomie administrative et financière sont garantis par la Constitution et définis par la Loi."
        },
        {
          "id": 4,
          "title": "Article 4",
          "content": "La République de Madagascar a pour devise : « Fitiavana – Tanindrazana – Fandrosoana ».\nSon emblème national est le drapeau tricolore blanc, rouge, vert, composé de trois bandes rectangulaires d'égales dimensions, la première verticale de couleur blanche du côté de la hampe, les deux autres horizontales, la supérieure rouge et l'inférieure verte.\nLa langue nationale est le malagasy.\nL'hymne national est « Ry Tanindrazanay malala ô ! »\nLa Capitale de la République de Madagascar est Antananarivo.\nLes sceaux de l'Etat et les armoiries de la République sont définis par la loi.\nLes langues officielles sont le malagasy et le français."
        },
        {
          "id": 5,
          "title": "Article 5",
          "content": "La souveraineté appartient au peuple, source de tout pouvoir, qui l'exerce par ses représentants élus au suffrage universel direct ou indirect, ou par la voie du référendum. Aucune fraction du peuple, ni aucun individu ne peut s'attribuer l'exercice de la souveraineté.\nL' organisation et la gestion de toutes les opérations électorales relèvent de la compétence d’une structure nationale indépendante.\nLa loi organise les modalités de fonctionnement de ladite structure.\nSont électeurs dans les conditions déterminées par la loi tous les nationaux des deux sexes jouissant de l'exercice de leurs droits civils et politiques. La qualité d'électeur ne se perd que par une décision de justice devenue définitive."
        },
        {
          "id": 6,
          "title": "Article 6",
          "content": "La loi est l'expression de la volonté générale. Elle est la même pour tous, qu'elle protège, qu'elle oblige ou qu'elle punisse.\nTous les individus sont égaux en droit et jouissent des mêmes libertés fondamentales protégées par la loi sans discrimination fondée sur le sexe, le degré d'instruction, la fortune, l'origine, la croyance religieuse ou l'opinion.\nLa loi favorise l'égal accès et la participation des femmes et des hommes aux emplois publics et aux fonctions dans le domaine de la vie politique, économique et sociale."
        }
      ],
      "subtitles": []
    },
    {
      "title": "Titre II. Des libertés, des droits et des devoirs des citoyens.",
      "range": "Art.7-Art.39",
      "articles": [],
      "subtitles": [
        {
          "title": "Sous-titre I. Des droits et des devoirs civils et politiques.",
          "articles": [
            {
              "id": 7,
              "title": "Article 7",
              "content": "Les droits individuels et les libertés fondamentales sont garantis par la Constitution et leur exercice est organisé par la loi."
            },
            {
              "id": 8,
              "title": "Article 8",
              "content": "Le droit de toute personne à la vie est protégé par la Loi. Nul ne peut être arbitrairement privé de la vie. La mort n’est pas considérée comme infligée en violation de cet article dans les cas où elle résulterait d’un recours à la force rendue absolument nécessaire, en vue d’assurer la défense de toute personne contre la violence illégale.\nNul ne peut être soumis à la torture ni à des peines ou traitements cruels, inhumains ou dégradants.\nEn particulier, il est interdit de soumettre une personne sans son libre consentement à une expérience médicale ou scientifique."
            },
            {
              "id": 9,
              "title": "Article 9",
              "content": "Toute personne a droit à la liberté et ne peut faire l'objet d'une arrestation ou d'une détention arbitraire.\nNul ne peut être poursuivi, arrêté ou détenu que dans les cas déterminés par la loi et selon les formes qu'elle a prescrites.\nTout individu victime d'arrestation ou de détention illégale a droit à réparation."
            },
            {
              "id": 10,
              "title": "Article 10",
              "content": "Les libertés d'opinion et d'expression, de communication, de presse, d'association, de réunion, de circulation, de conscience et de religion sont garanties à tous et ne peuvent être limitées que par le respect des libertés et droits d'autrui, et par l'impératif de sauvegarde de l'ordre public, de la dignité nationale et de la sécurité de l'Etat."
            },
            {
              "id": 11,
              "title": "Article 11",
              "content": "Tout individu a droit à l'information.\nL'information sous toutes ses formes n'est soumise à aucune contrainte préalable, sauf celle portant atteinte à l'ordre public et aux bonnes moeurs.\nLa liberté d’information, quel qu’en soit le support, est un droit. L' exercice de ce droit comporte des devoirs et des responsabilités, et est soumis à certaines formalités, conditions, ou sanctions prévues par la loi, qui constituent des mesures nécessaires dans une société démocratique. Toute forme de censure est interdite.\nL' exercice de la profession de journaliste est organisé par la loi."
            },
            {
              "id": 12,
              "title": "Article 12",
              "content": "Tout ressortissant malagasy a le droit de quitter le territoire national et d'y rentrer dans les conditions fixées par loi.\nTout individu a le droit de circuler et de s'établir librement sur tout le territoire de la République dans le respect des droits d'autrui et des prescriptions de la loi."
            },
            {
              "id": 13,
              "title": "Article 13",
              "content": "Tout individu est assuré de l'inviolabilité de sa personne, de son domicile et du secret de sa correspondance.\nNulle perquisition ne peut avoir lieu qu'en vertu de la loi et sur ordre écrit de l'autorité judiciaire compétente, hormis le cas de flagrant délit.\nNul ne peut être puni qu'en vertu d'une loi promulguée et publiée antérieurement à la commission de l'acte punissable.\nNul ne peut être puni deux fois pour le même fait. La loi assure à tous le droit de se faire rendre justice, et l'insuffisance des ressources ne saurait y faire obstacle. L'Etat garantit la plénitude et l'inviolabilité des droits de la défense devant toutes les juridictions et à tous les stades de la procédure, y compris celui de l'enquête préliminaire, au niveau de la police judiciaire ou du parquet.\nToute pression morale et/ou toute brutalité physique pour appréhender une personne ou la maintenir en détention sont interdites.\nTout prévenu ou accusé a droit à la présomption d'innocence jusqu'à ce que sa culpabilité soit établie par une décision de justice devenue définitive.\nLa détention préventive est une exception."
            },
            {
              "id": 14,
              "title": "Article 14",
              "content": "Toute personne a le droit de constituer librement des associations sous réserve de se conformer à la loi.\nCe même droit est reconnu pour la création de partis politiques. Les conditions de leur création sont déterminées par une loi sur les partis politiques et leur financement.\nSont interdits les associations et les partis politiques qui mettent en cause l'unité de la Nation et les principes républicains, et qui prônent le totalitarisme ou le ségrégationnisme à caractère ethnique, tribal ou confessionnel.\nLes partis et organisations politiques concourent à l'expression du suffrage.\nLa Constitution garantit le droit d'opposition démocratique.\nAprès chaque élection législative, les groupes politiques d’opposition désignent un chef de l'opposition. A défaut d’accord, le chef du groupe politique d’opposition ayant obtenu le plus grand nombre de suffrages exprimés lors du vote est considéré comme chef de l'opposition officiel.\nLe statut de l'opposition et des partis d’opposition, reconnu par la présente Constitution et leur donnant notamment un cadre institutionnel pour s’exprimer, est déterminé par la loi."
            },
            {
              "id": 15,
              "title": "Article 15",
              "content": "Tout citoyen a le droit de se porter candidat aux élections prévues par la présente Constitution, sous réserve des conditions fixées par la loi."
            },
            {
              "id": 16,
              "title": "Article 16",
              "content": "Dans l'exercice des droits et libertés reconnus par la présente Constitution, tout individu est tenu au devoir de respect de la Constitution, des Institutions, des lois et règlements de la République."
            }
          ],
          "chapiters": []
        },
        {
          "title": "Sous-titre II. Des droits et des devoirs économiques, sociaux et culturels",
          "articles": [
            {
              "id": 17,
              "title": "Article 17",
              "content": "L'Etat protège et garantit l'exercice des droits qui assurent à l'individu son intégrité et la dignité de sa personne, son plein épanouissement physique, intellectuel et moral."
            },
            {
              "id": 18,
              "title": "Article 18",
              "content": "Le Service National légal est un devoir d'honneur.\nSon accomplissement ne porte pas atteinte à la position de travail du citoyen ni à l'exercice des droits politiques du citoyen."
            },
            {
              "id": 19,
              "title": "Article 19",
              "content": "L'Etat reconnaît et organise pour tout individu le droit à la protection de la santé dès sa conception par l'organisation des soins publics gratuits, dont la gratuité résulte de la capacité de la solidarité nationale."
            },
            {
              "id": 20,
              "title": "Article 20",
              "content": "La famille, élément naturel et fondamental de la société, est protégée par l'Etat. Tout individu a le droit de fonder une famille et de transmettre en héritage ses biens personnels."
            },
            {
              "id": 21,
              "title": "Article 21",
              "content": "L'Etat assure la protection de la famille pour son libre épanouissement ainsi que celle de la mère et de l'enfant par une législation et des institutions sociales appropriées."
            },
            {
              "id": 22,
              "title": "Article 22",
              "content": "L'Etat s'engage à prendre les mesures nécessaires en vue d'assurer le développement intellectuel de tout individu sans autre limitation que les aptitudes de chacun."
            },
            {
              "id": 23,
              "title": "Article 23",
              "content": "Tout enfant a droit à l'instruction et à l'éducation sous la responsabilité des parents dans le respect de leur liberté de choix. L'Etat s'engage à développer la formation professionnelle."
            },
            {
              "id": 24,
              "title": "Article 24",
              "content": "L'Etat organise un enseignement public, gratuit et accessible à tous. L'enseignement primaire est obligatoire pour tous."
            },
            {
              "id": 25,
              "title": "Article 25",
              "content": "L'Etat reconnaît le droit à l'enseignement privé et garantit cette liberté d'enseignement sous réserve d’équivalence des conditions d’enseignement en matière d'hygiène, de moralité et de niveau de formation fixées par la loi.\nCes établissements d'enseignement privé sont soumis à un régime fiscal dans les conditions fixées par la loi."
            },
            {
              "id": 26,
              "title": "Article 26",
              "content": "Tout individu a le droit de participer à la vie culturelle de la communauté, au progrès scientifique et aux bienfaits qui en résultent.\nL'Etat assure, avec le concours des Collectivités territoriales décentralisées, la promotion et la protection du patrimoine culturel national ainsi que de la production scientifique, littéraire et artistique.\nL'Etat, avec le concours des Collectivités territoriales décentralisées, garantit le droit de propriété intellectuelle."
            },
            {
              "id": 27,
              "title": "Article 27",
              "content": "Le travail et la formation professionnelle sont, pour tout citoyen, un droit et un devoir.\nL'accès aux fonctions publiques est ouvert à tout citoyen sans autres conditions que celles de la capacité et des aptitudes.\nToutefois, le recrutement dans la fonction publique peut être assorti de contingentement par circonscription pendant une période dont la durée et les modalités seront déterminées par la loi."
            },
            {
              "id": 28,
              "title": "Article 28",
              "content": "Nul ne peut être lésé dans son travail ou dans son emploi en raison du sexe, de l'âge, de la religion, des opinions, des origines, de l'appartenance à une organisation syndicale ou des convictions politiques."
            },
            {
              "id": 29,
              "title": "Article 29",
              "content": "Tout citoyen a droit à une juste rémunération de son travail lui assurant, ainsi qu'à sa famille, une existence conforme à la dignité humaine."
            },
            {
              "id": 30,
              "title": "Article 30",
              "content": "L'Etat s'efforce de subvenir aux besoins de tout citoyen qui, en raison de son âge ou de son inaptitude physique ou mentale, se trouve dans l'incapacité de travailler, notamment par l'intervention d’institutions ou d'organismes à caractère social."
            },
            {
              "id": 31,
              "title": "Article 31",
              "content": "L'Etat reconnaît le droit de tout travailleur de défendre ses intérêts par l'action syndicale et en particulier par la liberté de fonder un syndicat. L'adhésion à un syndicat est libre."
            },
            {
              "id": 32,
              "title": "Article 32",
              "content": "Tout travailleur a le droit de participer, notamment par l'intermédiaire de ses délégués, à la détermination des règles et des conditions de travail."
            },
            {
              "id": 33,
              "title": "Article 33",
              "content": "Le droit de grève est reconnu sans qu’il puisse être porté préjudice à la continuité du service public ni aux intérêts fondamentaux de la Nation. Les autres conditions d'exercice de ce droit sont fixées par la loi."
            },
            {
              "id": 34,
              "title": "Article 34",
              "content": "L'Etat garantit le droit à la propriété individuelle. Nul ne peut en être privé sauf par voie d'expropriation pour cause d'utilité publique et moyennant juste et préalable indemnité.\nL' Etat assure la facilité d’accès à la propriété foncière à travers des dispositifs juridiques et institutionnels appropriés et d’une gestion transparente des informations foncières."
            },
            {
              "id": 35,
              "title": "Article 35",
              "content": "L' Etat facilite l'accès des citoyens au logement à travers des mécanismes de financement appropriés."
            },
            {
              "id": 36,
              "title": "Article 36",
              "content": "La participation de chaque citoyen aux dépenses publiques doit être progressive et calculée en fonction de sa capacité contributive."
            },
            {
              "id": 37,
              "title": "Article 37",
              "content": "L'Etat garantit la liberté d'entreprise dans la limite du respect de l'intérêt général, de l'ordre public, des bonnes moeurs et de l'environnement."
            },
            {
              "id": 38,
              "title": "Article 38",
              "content": "L'Etat garantit la sécurité des capitaux et des investissements."
            },
            {
              "id": 39,
              "title": "Article 39",
              "content": "L' Etat garantit la neutralité politique de l'Administration, des Forces Armées, de la Justice, de la Police, de l'Enseignement et de l'Education.\nIl organise l'Administration afin d’éviter tout acte de gaspillage et de détournement des fonds publics à des fins personnelles ou politiques."
            }
          ],
          "chapiters": []
        }
      ]
    },
    {
      "title": "Titre III. De l'organisation de l'État.",
      "range": "Art.40-Art.136",
      "articles": [
        {
          "id": 40,
          "title": "Article 40",
          "content": "Les Institutions de l'Etat sont :\n- le Président de la République et le Gouvernement ;\n- l'Assemblée Nationale et le Sénat ;\n- la Haute Cour Constitutionnelle.\nLa Cour Suprême, les Cours d’Appel et les juridictions qui leur sont rattachées ainsi que la Haute Cour de Justice exercent la fonction juridictionnelle."
        },
        {
          "id": 41,
          "title": "Article 41",
          "content": "La loi détermine le montant, les conditions et les modalités d'attribution des indemnités allouées aux personnalités appelées à exercer un mandat public, à accomplir des fonctions ou à effectuer des missions au sein des Institutions prévues par la présente Constitution.\nPréalablement à l'accomplissement de fonctions ou de missions et à l'exercice d’un mandat, toutes les personnalités visées au précédent alinéa déposent auprès de la Haute Cour Constitutionnelle une déclaration de patrimoine.\nA l'exception de ses droits et sous peine de déchéance, aucune des personnalités visées à l'article 40 ne peut accepter d'une personne physique ou morale, étrangère ou nationale, des émoluments ou rétributions dans le cadre de ses fonctions.\nLa loi fixe les modalités d'application de ces dispositions, notamment en ce qui concerne la détermination des droits, des émoluments et des rétributions ainsi que la procédure de déchéance."
        },
        {
          "id": 42,
          "title": "Article 42",
          "content": "Les fonctions au service des institutions de l'Etat ne peuvent constituer une source d’enrichissement illicite ni un moyen de servir des intérêts privés."
        },
        {
          "id": 43,
          "title": "Article 43",
          "content": "Le Haut Conseil pour la Défense de la Démocratie et de l'Etat de droit est chargé d’observer le respect de l'éthique du pouvoir, de la démocratie et du respect de l'Etat de droit, de contrôler la promotion et la protection des droits de l'homme.\nLes modalités relatives à la composition, à l'organisation et au fonctionnement du Haut Conseil sont fixées par la loi."
        }
      ],
      "subtitles": [
        {
          "title": "Sous-titre I. De l'exécutif",
          "articles": [
            {
              "id": 44,
              "title": "Article 44",
              "content": "La fonction exécutive est exercée par le Président de la République et le Gouvernement."
            }
          ],
          "chapiters": [
            {
              "title": "Chapitre I. Du Président de la République.",
              "articles": [
                {
                  "id": 45,
                  "title": "Article 45",
                  "content": "Le Président de la République est le Chef de l'Etat.\nIl est élu au suffrage universel direct pour un mandat de cinq ans renouvelable une seule fois.\nIl est le garant, par son arbitrage, du fonctionnement régulier et continu des pouvoirs publics, de l'indépendance nationale et de l'intégrité territoriale. Il veille à la sauvegarde et au respect de la souveraineté nationale tant à l'intérieur qu'à l'extérieur. Il est le garant de l'Unité nationale.\nLe Président de la République assure ces missions dans le cadre des pouvoirs qui lui sont conférés par la présente Constitution."
                },
                {
                  "id": 46,
                  "title": "Article 46",
                  "content": "Tout candidat aux fonctions de Président de la République doit être de nationalité malagasy, jouir de ses droits civils et politiques, avoir au moins trente cinq ans à la date de clôture du dépôt des candidatures, résider sur le territoire de la République de Madagascar depuis au moins six mois avant le jour de la date limite fixée pour le dépôt des candidatures.\nLe Président de la République en exercice qui se porte candidat aux élections Présidentielles démissionne de son poste soixante jours avant la date du scrutin Présidentiel. Dans ce cas, le Président du Sénat exerce les attributions Présidentielles courantes jusqu’à l'investiture du nouveau Président.\nDans le cas où le Président du Sénat lui-même se porte candidat, les fonctions de Chef de l'Etat sont exercées par le Gouvernement, collégialement.\nIl est interdit à toute personnalité exerçant un mandat public ou accomplissant des fonctions au sein des Institutions et candidat à l'élection présidentielle, d'user à des fins de propagande électorale, de moyens ou de prérogatives dont elle dispose du fait de ses fonctions. La violation qui en serait constatée par la Haute Cour constitutionnelle constitue une cause d’invalidation de la candidature."
                },
                {
                  "id": 47,
                  "title": "Article 47",
                  "content": "L'élection du Président de la République a lieu trente jours au moins et soixante jours au plus avant l'expiration du mandat du Président en exercice.\nDans les cas prévus aux articles 52 et 132 de la présente Constitution, ces délais courent après la constatation de la vacance par la Haute Cour Constitutionnelle.\nL'élection a lieu au premier tour à la majorité absolue des suffrages exprimés. Si celle-ci n'est pas obtenue, le Président de la République est élu au second tour à la majorité des suffrages exprimés parmi les deux candidats ayant recueilli le plus grand nombre de suffrages au premier tour. Le second tour a lieu trente jours au plus après la proclamation officielle des résultats du premier tour.\nEn cas de décès d'un candidat avant un tour de scrutin, ou s'il survient un autre cas de force majeure dûment constaté par la Haute Cour Constitutionnelle, l'élection est reportée à une nouvelle date dans les conditions et selon les modalités qui seront définies par une loi organique.\nLe Président en exercice non candidat aux élections reste en fonction, jusqu'à l'investiture de son successeur dans les conditions prévues à l'article 48."
                },
                {
                  "id": 48,
                  "title": "Article 48",
                  "content": "La passation officielle du pouvoir se fait entre le Président sortant et le Président nouvellement élu.\nAvant son entrée en fonction, le Président de la République, en audience solennelle de la Haute Cour Constitutionnelle, devant la Nation, et en présence du Gouvernement, de l'Assemblée Nationale, du Sénat et de la Cour Suprême, prête le serment suivant :\n« Eto anatrehan'Andriamanitra Andriananahary sy ny Firenena ary ny Vahoaka, mianiana aho fa hanantanteraka an-tsakany sy an-davany ary amim-pahamarinana ny andraikitra lehibe maha-Filohan'ny Firenena Malagasy ahy. Mianiana aho fa hampiasa ny fahefana natolotra ahy ary hanokana ny heriko rehetra hiarovana sy hanamafisana ny firaisam-pirenena sy ny zon’olombelona. Mianiana aho fa hanaja sy hitandrina toy ny anakandriamaso ny Lalàmpanorenana sy ny lalàm-panjakana, hikatsaka hatrany ny soa ho an’ny Vahoaka Malagasy tsy ankanavaka ».\nLe mandat présidentiel commence à partir du jour de la prestation de serment."
                },
                {
                  "id": 49,
                  "title": "Article 49",
                  "content": "Les fonctions de Président de la République sont incompatibles avec toute fonction publique élective, toute autre activité professionnelle, toute activité au sein d'un parti politique, d’un groupement politique, ou d’une association, et de l'exercice de responsabilité au sein d’une institution religieuse.\nToute violation des dispositions du présent article, constatée par la Haute Cour Constitutionnelle, constitue un motif d’empêchement définitif du Président de la République."
                },
                {
                  "id": 50,
                  "title": "Article 50",
                  "content": "L'empêchement temporaire du Président de la République est déclaré par la Haute Cour Constitutionnelle, saisie par l'Assemblée Nationale, statuant à la majorité des deux tiers de ses membres, pour cause d'incapacité physique ou mentale d'exercer ses fonctions dûment établie.\nEn cas d’empêchement temporaire, les fonctions de Chef de l'Etat sont provisoirement exercées par le Président du Sénat."
                },
                {
                  "id": 51,
                  "title": "Article 51",
                  "content": "La levée de l'empêchement temporaire est décidée par la Haute Cour Constitutionnelle sur saisine du Parlement.\nL'empêchement temporaire ne peut dépasser une période de trois mois, à l'issue de laquelle la Haute Cour Constitutionnelle, sur saisine du Parlement statuant par vote séparé de chacune des Assemblées et à la majorité des deux tiers de ses membres, peut se prononcer sur la transformation de l'empêchement temporaire en empêchement définitif."
                },
                {
                  "id": 52,
                  "title": "Article 52",
                  "content": "Par suite de démission, d’abandon du pouvoir sous quelque forme que ce soit, de décès, d’empêchement définitif ou de déchéance prononcée, la vacance de la Présidence de la République est constatée par la Haute Cour Constitutionnelle.\nDès la constatation de la vacance de la présidence, les fonctions du Chef de l'Etat sont exercées par le Président du Sénat.\nEn cas d’empêchement du Président du Sénat constatée par la Haute Cour Constitutionnelle, les fonctions de Chef de l'Etat sont exercées collégialement par le Gouvernement."
                },
                {
                  "id": 53,
                  "title": "Article 53",
                  "content": "Après la constatation par la Haute Cour Constitutionnelle de la vacance de la Présidence de la République, il est procédé à l'élection d’un nouveau Président de la République dans un délai de 30 jours au moins et 60 jours au plus, conformément aux dispositions des articles 46 et 47 de la Constitution.\nPendant la période allant de la constatation de la vacance à l'investiture du nouveau Président de la République ou à la levée de l'empêchement temporaire, il ne peut être fait application des articles 60, 100, 103, 162 et 163 de la Constitution."
                },
                {
                  "id": 54,
                  "title": "Article 54",
                  "content": "Le Président de la République nomme le Premier ministre, présenté par le parti ou le groupe de partis majoritaire à l'Assemblée Nationale.\nIl met fin aux fonctions du Premier Ministre, soit sur la présentation par celui-ci de la démission du Gouvernement, soit en cas de faute grave ou de défaillance manifeste.\nSur proposition du Premier ministre, il nomme les membres du Gouvernement et met fin à leurs fonctions."
                },
                {
                  "id": 55,
                  "title": "Article 55",
                  "content": "Le Président de la République :\n1. préside le Conseil des Ministres ;\n2. signe les ordonnances prises en Conseil des Ministres dans les cas et les conditions prévues par la présente Constitution ;\n3. signe les décrets délibérés en Conseil de Ministres ;\n4. procède, en Conseil des Ministres, aux nominations dans les hauts emplois de l'Etat dont la liste est fixée par décret pris en Conseil de Ministres.\n5. peut, sur toute question importante à caractère national, décider en Conseil des Ministres, de recourir directement à l'expression de la volonté du peuple par voie de référendum;\n6. détermine et arrête, en Conseil des Ministres, la politique générale de l'Etat.\n7. contrôle la mise en oeuvre de la politique générale ainsi définie et l'action du gouvernement.\n8. dispose des organes de contrôle de l'Administration.\nLe Président de la République peut déléguer certains de ses pouvoirs au Premier Ministre."
                },
                {
                  "id": 56,
                  "title": "Article 56",
                  "content": "Le Président de la République est le Chef Suprême des Forces Armées dont il garantit l'unité. A ce titre, il est assisté par un Haut Conseil de la Défense Nationale.\nLe Haut Conseil de la Défense Nationale, sous l'autorité du Président de la République, a notamment pour mission de veiller à la coordination des actions confiées aux Forces armées afin de préserver la paix sociale. Son organisation et ses attributions sont fixées par la loi.\nLe Président de la République décide en Conseil des Ministres de l'engagement des forces et des moyens militaires pour les interventions extérieures, après avis du Haut Conseil de la Défense Nationale et du Parlement.\nIl arrête en Conseil des Ministres le concept de la défense nationale sous tous ses aspects militaire, économique, social, culturel, territorial et environnemental.\nLe Président de la République nomme les militaires appelés à représenter l'Etat auprès des organismes internationaux."
                },
                {
                  "id": 57,
                  "title": "Article 57",
                  "content": "Le Président de la République accrédite et rappelle les Ambassadeurs et les envoyés extraordinaires de la République auprès des autres Etats et des Organisations Internationales.\nIl reçoit les lettres de créance et de rappel des représentants des Etats et des Organisations Internationales reconnus par la République de Madagascar."
                },
                {
                  "id": 58,
                  "title": "Article 58",
                  "content": "Le Président de la République exerce le droit de grâce.\nIl confère les décorations et les honneurs de la République."
                },
                {
                  "id": 59,
                  "title": "Article 59",
                  "content": "Le Président de la République promulgue les lois dans les trois semaines qui suivent la transmission par l'Assemblée Nationale de la loi définitivement adoptée.\nAvant l'expiration de ce délai, le Président de la République peut demander au Parlement une nouvelle délibération de la loi ou de certains de ses articles. Cette nouvelle délibération ne peut être refusée."
                },
                {
                  "id": 60,
                  "title": "Article 60",
                  "content": "Le Président de la République peut, après information auprès du Premier Ministre, et après consultation des Présidents des Assemblées, prononcer la dissolution de l'Assemblée Nationale.\nLes élections générales se tiennent soixante jours au moins et quatre-vingt dix jours au plus après le prononcé de la dissolution.\nL'Assemblée Nationale se réunit de plein droit le deuxième jeudi qui suit son élection. Si cette réunion a lieu en dehors de la période prévue pour la session ordinaire, une session est ouverte de droit pour une durée de quinze jours.\nIl ne peut être procédé à une nouvelle dissolution dans les deux années qui suivent ces élections."
                },
                {
                  "id": 61,
                  "title": "Article 61",
                  "content": "Lorsque les Institutions de la République, l'indépendance de la Nation, son unité ou l'intégrité de son territoire sont menacées et que le fonctionnement régulier des pouvoirs publics se trouve compromis, le Président de la République peut proclamer, sur tout ou partie du territoire national, la situation d'exception, à savoir l'état d'urgence, l'état de nécessité ou la loi martiale. La décision est prise par le Président de la République en Conseil des Ministres, après avis des Présidents de l'Assemblée Nationale, du Sénat et de la Haute Cour Constitutionnelle.\nLa proclamation de la situation d'exception confère au Président de la République des pouvoirs spéciaux dont l'étendue et la durée sont fixées par une loi organique.\nDès la proclamation de l'une des situations d'exception précitées, le Président de la République peut légiférer par voie d'ordonnance pour des matières qui relèvent du domaine de la loi."
                },
                {
                  "id": 62,
                  "title": "Article 62",
                  "content": "Les actes du Président de la République, hors les cas prévus aux articles 54 alinéas 1er et 2, 58 alinéas 1 et 2, 59, 81, 60, 94, 100, 114, 117 et 119, sont contresignés par le Premier Ministre et, le cas échéant, par les Ministres concernés."
                }
              ]
            },
            {
              "title": "Chapitre II. Du Gouvernement",
              "articles": [
                {
                  "id": 63,
                  "title": "Article 63",
                  "content": "Le Gouvernement est composé du Premier Ministre et des Ministres.\nIl met en oeuvre la politique générale de l'Etat.\nIl est responsable devant l'Assemblée nationale dans les conditions prévues aux articles 100 et 103 ci-dessous.\nLe Gouvernement dispose de l'Administration."
                },
                {
                  "id": 64,
                  "title": "Article 64",
                  "content": "Les fonctions de membre du Gouvernement sont incompatibles avec l'exercice de tout mandat public électif, de toute fonction de représentation professionnelle, de l'exercice de toute fonction au sein d’institutions religieuses, de tout emploi public ou de toute autre activité professionnelle rémunérée.\nTout membre du Gouvernement, candidat à un mandat électif, doit démissionner de ses fonctions sitôt sa candidature déclarée recevable."
                },
                {
                  "id": 65,
                  "title": "Article 65",
                  "content": "Le Premier Ministre, Chef du Gouvernement :\n1. conduit la politique générale de l'Etat ;\n2. a autorité sur les membres du Gouvernement dont il dirige l'action, et est responsable de la coordination des activités des départements ministériels ainsi que de la mise en oeuvre de tout programme national de développement;\n3. a l'initiative des lois ;\n4. arrête les projets de lois à soumettre à la délibération du Conseil des Ministres et à déposer sur le bureau de l'une des deux Assemblées ;\n5. assure l'exécution des lois ;\n6. exerce le pouvoir réglementaire sous réserve des dispositions de l'article 55 alinéa 3 ;\n7. veille à l'exécution des décisions de justice ;\n8. saisit, en tant que de besoin, l'Inspection Générale de l'Etat et les autres organes de contrôle de l'Administration et s'assure du bon fonctionnement des services publics, de la bonne gestion des finances des collectivités publiques et des organismes publics de l'Etat ;\n9. assure la sécurité, la paix et la stabilité sur toute l'étendue du territoire national dans le respect de l'unité nationale ; à cette fin, il dispose de toutes les forces chargées de la police, du maintien de l'ordre, de la sécurité intérieure et de la défense ;\n10. en cas de troubles politiques graves et avant la proclamation de la situation d’exception, peut recourir aux forces de l'ordre pour rétablir la paix sociale après avis des autorités supérieures de la Police, de la Gendarmerie et de l'Armée, du Haut Conseil de la Défense Nationale et du Président de la Haute Cour Constitutionnelle ;\n11. est le Chef de l'Administration ;\n12. nomme aux emplois civils et militaires ainsi qu'à ceux des organismes relevant de l'Etat, sous réserve des dispositions de l'article 55 alinéa 4.\nIl peut déléguer certains de ses pouvoirs aux membres du Gouvernement.\nIl assure le développement équilibré et harmonieux de toutes les Collectivités Territoriales Décentralisées.\nSans préjudice des dispositions de l'article 55, il peut, à titre exceptionnel, sur délégation expresse du Président de la République et sur un ordre du jour déterminé, présider le Conseil des Ministres."
                },
                {
                  "id": 66,
                  "title": "Article 66",
                  "content": "Le Premier Ministre préside le Conseil de Gouvernement. En Conseil de Gouvernement :\n1. il fixe le programme de mise en oeuvre de la politique générale de l'Etat et arrête les mesures à prendre pour en assurer l'exécution ;\n2. il exerce les autres attributions pour lesquelles la consultation du Gouvernement est obligatoire en vertu de la présente Constitution et des lois particulières.\n3. il décide des mesures de mise en oeuvre des programmes nationaux de développement économique et social, ainsi que de celui de l'aménagement du territoire, en collaboration avec les autorités des Collectivités Territoriales Décentralisées."
                },
                {
                  "id": 67,
                  "title": "Article 67",
                  "content": "Les actes du Premier Ministre sont contresignés, le cas échéant, par les Ministres chargés de leur exécution."
                }
              ]
            }
          ]
        },
        {
          "title": "Sous-titre II. Du législatif.",
          "articles": [
            {
              "id": 68,
              "title": "Article 68",
              "content": "Le Parlement comprend l'Assemblée Nationale et le Sénat. Il vote la loi. Il contrôle l'action du Gouvernement. Il évalue les politiques publiques."
            }
          ],
          "chapiters": [
            {
              "title": "Chapitre I. De l'Assemblée nationale.",
              "articles": [
                {
                  "id": 69,
                  "title": "Article 69",
                  "content": "Les membres de l'Assemblée Nationale sont élus pour cinq ans au suffrage universel direct.\nLe régime des scrutins est déterminé par une loi organique.\nLes membres de l'Assemblée Nationale portent le titre de « Député de Madagascar »."
                },
                {
                  "id": 70,
                  "title": "Article 70",
                  "content": "Un décret pris en Conseil des Ministres fixe le nombre des membres de l'Assemblée Nationale, la répartition des sièges sur l'ensemble du territoire national ainsi que le découpage des circonscriptions électorales."
                },
                {
                  "id": 71,
                  "title": "Article 71",
                  "content": "Le mandat de député est incompatible avec l'exercice de tout autre mandat public électif et de tout emploi public, excepté l'enseignement.\nLe député nommé membre du Gouvernement est suspendu d’office de son mandat. Il est remplacé par son suppléant.\nLe député exerce son mandat suivant sa conscience et dans le respect des règles d'éthique déterminées dans les formes fixées à l'article 79 ci-dessous."
                },
                {
                  "id": 72,
                  "title": "Article 72",
                  "content": "Durant son mandat, le député ne peut, sous peine de déchéance, changer de groupe politique pour adhérer à un nouveau groupe, autre que celui au nom duquel il s’est fait élire.\nEn cas d’infraction à l'alinéa précédent, la sanction est la déchéance qui est prononcée par la Haute Cour Constitutionnelle.\nLe député élu sans appartenance à un parti peut adhérer au groupe parlementaire de son choix au sein de l'Assemblée.\nLa déchéance d’un député peut également être prononcée par la Haute Cour Constitutionnelle s’il dévie de la ligne de conduite de son groupe parlementaire.\nLe régime de déchéance et les règles d’éthique et de déontologie sont déterminés par la loi sur les partis politiques et les réglementations en matière de financement des partis politiques."
                },
                {
                  "id": 73,
                  "title": "Article 73",
                  "content": "Aucun député ne peut être poursuivi, recherché, arrêté, détenu ou jugé à l'occasion des opinions ou votes émis par lui dans l'exercice de ses fonctions.\nAucun député ne peut, pendant les sessions, être poursuivi et arrêté en matière criminelle ou correctionnelle, qu'avec l'autorisation de l'Assemblée, sauf en cas de flagrant délit.\nAucun député ne peut, hors session, être arrêté qu’avec l'autorisation du Bureau de l'Assemblée, sauf en cas de flagrant délit de poursuites autorisées ou de condamnation définitive.\nToute personne justifiant d’un intérêt peut saisir par écrit le Bureau Permanent de l'Assemblée Nationale pour mettre en cause un député. Le Bureau doit y apporter une réponse circonstanciée dans un délai de trois mois."
                },
                {
                  "id": 74,
                  "title": "Article 74",
                  "content": "Le Président de l'Assemblée Nationale et les membres du Bureau sont élus au début de la première session pour la durée de la législature.\nToutefois, ils peuvent être démis de leurs fonctions respectives de membres de Bureau pour motif grave par un vote secret des deux tiers des députés."
                },
                {
                  "id": 75,
                  "title": "Article 75",
                  "content": "L'Assemblée Nationale se réunit de plein droit en deux sessions ordinaires par an. La durée de chaque session est fixée à soixante jours.\nLa première session commence le premier mardi de mai et la seconde, consacrée principalement à l'adoption de la loi de finances, le troisième mardi d'octobre."
                },
                {
                  "id": 76,
                  "title": "Article 76",
                  "content": "L'Assemblée Nationale est réunie en session extraordinaire, sur un ordre du jour déterminé, par décret du Président de la République pris en Conseil des Ministres, soit à l'initiative du Premier Ministre, soit à la demande de la majorité absolue des membres composant l'Assemblée Nationale.\nLa durée de la session ne peut excéder douze jours. Toutefois, un décret de clôture intervient dès que l'Assemblée Nationale a épuisé l'ordre du jour pour lequel elle a été convoquée."
                },
                {
                  "id": 77,
                  "title": "Article 77",
                  "content": "Les séances de l'Assemblée Nationale sont publiques. Il en est tenu procès-verbal dont la publicité est assurée dans les conditions prévues par la loi.\nL'Assemblée Nationale siège à huis clos à la demande du quart de ses membres ou du Gouvernement. Il est dressé un procès-verbal des décisions arrêtées."
                },
                {
                  "id": 78,
                  "title": "Article 78",
                  "content": "L' Assemblée Nationale se réunit de plein droit en session spéciale le deuxième mardi qui suit la proclamation des résultats de son élection pour procéder à la constitution de son bureau et à la formation des commissions.\nL' opposition a droit à un poste de vice-président et préside au moins l'une des commissions.\nLa session est close après épuisement de l'ordre du jour."
                },
                {
                  "id": 79,
                  "title": "Article 79",
                  "content": "Les règles relatives au fonctionnement de l'Assemblée Nationale sont fixées dans leurs principes généraux par une loi organique et dans leurs modalités par son règlement intérieur. Le règlement intérieur est publié au Journal officiel de la République."
                }
              ]
            },
            {
              "title": "Chapitre II. Du Sénat.",
              "articles": [
                {
                  "id": 80,
                  "title": "Article 80",
                  "content": "Les membres du Sénat portent le titre de « Sénateur de Madagascar ». Leur mandat est de cinq ans, sauf en ce qui concerne le Président du Sénat, en application de l'article 46 alinéa 2 de la présente Constitution."
                },
                {
                  "id": 81,
                  "title": "Article 81",
                  "content": "Le Sénat représente les Collectivités Territoriales Décentralisées et les organisations économiques et sociales. Il comprend, pour deux tiers, des membres élus en nombre égal pour chaque Province, et pour un tiers, des membres nommés par le Président de la République, pour partie, sur présentation des groupements les plus représentatifs issus des forces économiques sociales et culturelles et pour partie en raison de leur compétence particulière."
                },
                {
                  "id": 82,
                  "title": "Article 82",
                  "content": "Les règles de fonctionnement du Sénat, sa composition ainsi que les modalités d'élection et de désignation de ses membres sont fixées par une loi organique."
                },
                {
                  "id": 83,
                  "title": "Article 83",
                  "content": "Le Sénat est consulté par le Gouvernement pour donner son avis sur les questions économiques, sociales et d'organisation des Collectivités Territoriales Décentralisées."
                },
                {
                  "id": 84,
                  "title": "Article 84",
                  "content": "Le Sénat se réunit de plein droit en deux sessions ordinaires par an. La durée de chaque session est fixée à soixante jours.\nLa première session commence le premier mardi de mai et la seconde, consacrée principalement à l'adoption de la loi de finances, le troisième mardi d'octobre.\nIl peut être également réuni en session spéciale sur convocation du Gouvernement. Son ordre du jour est alors limitativement fixé par le décret de convocation pris en Conseil des Ministres.\nLorsque l'Assemblée nationale ne siège pas, le Sénat ne peut discuter que des questions dont le Gouvernement l'a saisi pour avis, à l'exclusion de tout projet législatif."
                },
                {
                  "id": 85,
                  "title": "Article 85",
                  "content": "Les dispositions des articles 71 à 79 sont applicables, par analogie, au Sénat."
                }
              ]
            },
            {
              "title": "Chapitre III. Des rapports entre le Gouvernement et le Parlement.",
              "articles": [
                {
                  "id": 86,
                  "title": "Article 86",
                  "content": "L'initiative des lois appartient concurremment au Premier Ministre, aux Députés et aux Sénateurs.\nLes projets de loi sont délibérés en Conseil des Ministres et déposés sur le bureau de l'une des deux Assemblées.\nL'ordre du jour des Assemblées comporte par priorité et dans l'ordre du jour fixé par le Gouvernement la discussion des projets de lois déposés sur le bureau de l'Assemblée Nationale ou celui du Sénat par le Premier Ministre.\nLes propositions de loi et amendements déposés par les parlementaires sont portés à la connaissance du Gouvernement qui dispose, pour formuler ses observations, d'un délai de trente jours pour les propositions et de quinze jours pour les amendements.\nA l'expiration de ce délai, l'Assemblée devant laquelle ont été déposés les propositions ou les amendements procède à l'examen de ceux-ci en vue de leur adoption.\nLes propositions ou amendements ne sont pas recevables lorsque leur adoption aura pour conséquence, dans le cadre de l'exercice budgétaire en cours, soit la diminution des ressources publiques soit l'aggravation des charges de l'Etat, sauf en matière de loi de finances.\nS'il apparaît, au cours de la procédure législative, qu'une proposition ou un amendement n'est pas du domaine de la loi, le Gouvernement peut opposer l'irrecevabilité. En cas de désaccord entre le Gouvernement et l'Assemblée nationale ou le Sénat, la Haute Cour Constitutionnelle, à la demande du Premier Ministre ou du Président de l'une ou de l'autre Assemblée parlementaire, statue dans un délai de huit jours.\nDeux semaines de séance sur quatre, au moins, sont réservées à l'examen des textes et aux débats dont le gouvernement demande l'inscription à l'ordre du jour."
                },
                {
                  "id": 87,
                  "title": "Article 87",
                  "content": "Les lois organiques, les lois de finances et les lois ordinaires sont votées par le Parlement dans les conditions fixées par la présente Constitution."
                },
                {
                  "id": 88,
                  "title": "Article 88",
                  "content": "Outre les questions qui lui sont renvoyées par d'autres articles de la Constitution, relèvent d'une loi organique :\n1. les règles relatives à l'élection du Président de la République ;\n2. les modalités de scrutin relatives à l'élection des députés, les conditions d'éligibilité, le régime d'incompatibilité et de déchéance, les règles de remplacement en cas de vacance, l'organisation et le fonctionnement de l'Assemblée Nationale ;\n3. les modalités de scrutin relatives à l'élection des Sénateurs, les conditions d'éligibilité, le régime d'incompatibilité et de déchéance, les règles de remplacement en cas de vacance, l'organisation et le fonctionnement du Sénat ;\n4. les règles régissant les compétences, les modalités d‘organisation et de fonctionnement des Collectivités Territoriales Décentralisées, ainsi que celles de la gestion de leurs propres affaires;\n5. l'organisation, la composition, le fonctionnement et les attributions de la Cour Suprême et des trois Cours la composant, celles relatives à la nomination de leurs membres ainsi que celles relatives à la procédure applicable devant elles;\n6. le statut des Magistrats ;\n7. l'organisation, le fonctionnement et les attributions du Conseil Supérieur de la Magistrature ;\n8. l'organisation, le fonctionnement, les attributions, la saisine et la procédure à suivre devant la Haute Cour de Justice ;\n9. l'organisation, le fonctionnement, les attributions, la saisine et la procédure à suivre devant la Haute Cour Constitutionnelle;\n10. le Code électoral ;\n11. les dispositions générales relatives aux lois de finances ;\n12. les dispositions générales relatives aux Marchés publics sur les ressources minières ;\n13. les situations d'exception ainsi que les limitations des libertés publiques, individuelles et collectives durant lesdites situations ;\n14. les dispositifs de péréquation destinés à favoriser l'égalité entre les collectivités territoriales."
                },
                {
                  "id": 89,
                  "title": "Article 89",
                  "content": "Les lois organiques sont votées et modifiées dans les conditions suivantes :\n1. le projet ou la proposition n'est soumis à la délibération et au vote de la première Assemblée saisie qu'à l'expiration d'un délai de 15 jours après son dépôt ;\n2. les procédures prévues aux articles 86, 96 et 98 sont applicables. Toutefois, une loi organique ne peut être adoptée qu'à la majorité absolue des membres composant chaque Assemblée ; faute d'accord entre les deux Assemblées après deux lectures, l'Assemblée Nationale statue définitivement à la majorité de deux tiers des membres la composant.\nSi l'Assemblée Nationale n'a pas adopté le projet de loi organique avant la clôture de la session, les dispositions dudit projet peuvent être mises en vigueur par voie d'ordonnance, en y incluant, le cas échéant, un ou plusieurs amendements adoptés par une Assemblée.\n3. les lois organiques relatives au Sénat doivent être votées dans les mêmes termes par les deux Assemblées.\nLes lois organiques ne peuvent être promulguées qu'après déclaration de leur conformité à la Constitution par la Haute Cour Constitutionnelle."
                },
                {
                  "id": 90,
                  "title": "Article 90",
                  "content": "Dans le cadre de la loi organique applicable en la matière, la loi de finances :\n1. détermine les ressources et les charges de l'État dans les conditions et sous les réserves prévues par une loi organique.\n2. détermine, pour un exercice, la nature, le montant et l'affectation des ressources et des charges de l'Etat ainsi que l'équilibre budgétaire et financier qui en résulte compte tenu des contraintes d'ordre macroéconomique ;\n3. détermine la proportion des recettes publiques devant revenir à l'Etat, aux Collectivités Territoriales Décentralisées ainsi que la nature et le taux maximum des impôts et taxes perçus directement au profit du budget desdites Collectivités, déterminées en Conseil des Ministres.\nLa loi organique détermine les modalités d’application des dispositions du présent article, ainsi que les dispositifs de péréquation destinés à favoriser l'égalité entre les Collectivités Territoriales Décentralisées.\nLa loi précise les conditions des emprunts et décide de la création éventuelle de fonds.\nLa loi détermine :\n- Les modalités d’utilisation des fonds d’emprunts extérieurs et de contrôle parlementaire et juridictionnel ;\n- Le régime de responsabilité personnelle et pécuniaire des autorités financières auteurs de détournement des fonds d’emprunt ainsi que celui du désengagement de responsabilité de l'Etat."
                },
                {
                  "id": 91,
                  "title": "Article 91",
                  "content": "Les lois de programme déterminent les objectifs de l'action de l'Etat en matière économique, environnementale, sociale et d'aménagement du territoire.\nLes dispositions du présent article sont précisées et complétées par une loi organique."
                },
                {
                  "id": 92,
                  "title": "Article 92",
                  "content": "Le Parlement examine le projet de loi de finances au cours de sa seconde session ordinaire.\nSous l'autorité du Premier Ministre, Chef du Gouvernement, les Ministres chargés des Finances et du Budget préparent le projet de loi de finances.\nLe Parlement dispose d'un délai maximum de soixante jours pour l'examiner.\nL'Assemblée Nationale dispose d'un délai maximum de trente jours à compter du dépôt du projet pour l'examiner en première lecture. Faute de s'être prononcée dans ce délai, elle est censée l'avoir adopté et le projet est transmis au Sénat.\nDans les mêmes conditions, celui-ci dispose pour la première lecture d'un délai de quinze jours à compter de la transmission du projet, et chaque Assemblée dispose d'un délai de cinq jours pour chacune des lectures suivantes.\nFaute par une Assemblée de s'être prononcée dans le délai imparti, elle est censée avoir émis un vote favorable sur le texte dont elle a été saisie.\nSi le Parlement n'a pas adopté le projet de loi de finances avant la clôture de la seconde session, les dispositions du projet peuvent être mises en vigueur par voie d'ordonnance en y incluant un ou plusieurs des amendements adoptés par les deux Assemblées.\nTout amendement au projet du budget entraînant un accroissement des dépenses ou une diminution des ressources publiques doit être accompagné d'une proposition d'augmentation de recette ou d'économie équivalente.\nSi le projet de loi de finances d'un exercice n'a pas été déposé en temps utile pour être adopté avant le début de cet exercice, le Premier Ministre est autorisé à percevoir les impôts et ouvre par décret les crédits se rapportant aux services votés.\nLes conditions d'adoption du projet de loi de finances sont prévues par une loi organique."
                },
                {
                  "id": 93,
                  "title": "Article 93",
                  "content": "La Cour des comptes assiste le Parlement dans le contrôle de l'action du Gouvernement. Elle assiste le Parlement et le Gouvernement dans le contrôle de l'exécution des lois de finances ainsi que dans l'évaluation des politiques publiques. Par ses rapports publics, elle contribue à l'information des citoyens.\nLes comptes des Administrations publiques doivent être réguliers et sincères, et donner une image fidèle du résultat de leur gestion, de leur patrimoine et de leur situation financière."
                },
                {
                  "id": 94,
                  "title": "Article 94",
                  "content": "Le Président de la République communique avec le Parlement par un message qui ne donne lieu à aucun débat."
                },
                {
                  "id": 95,
                  "title": "Article 95",
                  "content": "Outre les questions qui lui sont renvoyées par d'autres articles de la Constitution :\nI - La loi fixe les règles concernant :\n1. les droits civiques et les garanties fondamentales accordés aux individus, associations, partis politiques et à tout autre groupement pour l'exercice des droits et des libertés ainsi que leurs devoirs et obligations ;\n2. les relations internationales ;\n3. la nationalité ;\n4. la Banque Centrale et le régime d'émission de la monnaie ;\n5. la circulation des personnes ;\n6. les règles de procédure civile et commerciale ;\n7. les règles de procédure administrative et financière ;\n8. la détermination des crimes et délits ainsi que les peines qui leur sont applicables, la procédure pénale, l'amnistie ;\n9. les règles relatives aux conflits de lois et de compétences ;\n10. la création de nouveaux ordres de juridictions et leurs compétences respectives ainsi que leur organisation et les règles de procédure qui leur sont applicables ;\n11. l'organisation de la famille, l'état et la capacité des personnes, les régimes matrimoniaux, les successions et les libéralités ;\n12. le régime juridique de la propriété, des droits réels, des obligations civiles et commerciales et les conditions dans lesquelles les biens peuvent faire l'objet d'expropriation ou de réquisition pour cause de nécessité publique ou de transfert de propriété à l'Etat ;\n13. la création de catégorie d'établissements publics ;\n14. le statut et le régime d’autonomie des Universités, ainsi que le statut des enseignants de l'enseignement supérieur ;\n15. Les grandes orientations de valorisation de l'enseignement primaire et secondaire ;\n16. les ressources stratégiques ;\n17. l'organisation et le fonctionnement des Collectivités territoriales décentralisées ;\n18. les statuts particuliers de la Capitale de la République, de certaines portions du territoire national, des palais d'Etat et autres bâtiments relevant du domaine de l'Etat, des ports et de leurs réseaux d'éclatement, des aéroports et le régime des ressources marines ;\n19. la nature et l'assiette des impôts et taxes des Collectivités territoriales décentralisées.\n20. le Conseil de l'Ordre National Malagasy ;\n21. l'urbanisme et l'habitat ;\n22. les conditions de jouissance de terrains par les étrangers ;\n23. les conditions de transfert à l'Etat de terrains non mis en valeur.\n24. l'organisation, le fonctionnement et les attributions de l'Inspection Générale de l'Etat et des autres organes de contrôle de l'Administration ;\nII- La loi détermine les principes généraux :\n1. de l'organisation de la défense nationale et de l'utilisation des Forces armées ou des Forces de l'ordre par les autorités civiles ;\n2. du statut général des fonctionnaires civils et militaires de l'Etat et des fonctionnaires territoriaux;\n3. du droit du travail, du droit syndical, du droit de grève et de la prévoyance sociale ;\n4. des transferts de propriété d'entreprise ou d'organisme du secteur public au secteur privé et inversement ;\n5. de l'organisation ou du fonctionnement de différents secteurs d'activité juridique, économique, sociale et culturelle;\n6. de la protection de l'environnement.\nIII- La déclaration de guerre ne peut être autorisée que par le Parlement réuni en Congrès à la majorité absolue de tous les membres le composant."
                },
                {
                  "id": 96,
                  "title": "Article 96",
                  "content": "Tout projet ou proposition de loi est examiné en premier lieu par l'Assemblée devant laquelle il a été déposé puis transmis à l'autre Assemblée. La discussion a lieu successivement dans chaque Assemblée jusqu'à l'adoption d'un texte unique.\nLorsque par suite d'un désaccord entre les deux Assemblées, un projet ou une proposition de loi n'a pu être adoptée après deux lectures par chaque Assemblée ou si le Gouvernement a déclaré l'urgence, après une seule lecture par chacune d'elle, le Premier Ministre a la faculté de provoquer la réunion d'une commission mixte paritaire chargée de proposer un texte sur les dispositions restant en discussion. Le texte élaboré par la commission mixte peut être soumis par le Gouvernement pour approbation aux deux Assemblées. Aucun amendement n'est recevable sauf accord du Gouvernement.\nSi la commission ne parvient pas à l'adoption d'un texte commun ou si ce texte n'est pas adopté dans les conditions prévues à l'alinéa précédent, l'Assemblée nationale statue définitivement à la majorité absolue des membres la composant."
                },
                {
                  "id": 97,
                  "title": "Article 97",
                  "content": "Les matières autres que celles qui sont du domaine de la loi ont un caractère réglementaire. Les textes de forme législative intervenus en ces matières peuvent être modifiés par décret pris après avis de la Haute Cour Constitutionnelle.\nCeux de ces textes qui interviendraient après l'entrée en vigueur de la présente Constitution ne pourront être modifiés par décret que si la Haute Cour Constitutionnelle a déclaré qu'ils ont un caractère réglementaire en vertu de l'alinéa précédent."
                },
                {
                  "id": 98,
                  "title": "Article 98",
                  "content": "Le Gouvernement, en engageant sa responsabilité dans les conditions prévues à l'article 100 ci-dessous, peut exiger de chacune des Assemblées de se prononcer par un seul vote sur tout ou partie des dispositions des textes en discussion :\n- lors des sessions extraordinaires, à condition que ces textes aient été déposés dans les quarante-huit heures de l'ouverture de la session ;\n- dans les huit derniers jours de chacune des sessions ordinaires."
                },
                {
                  "id": 99,
                  "title": "Article 99",
                  "content": "Dans les trente jours de sa nomination, le Premier Ministre présente son programme de mise en oeuvre de la politique générale de l'Etat au Parlement qui peut émettre des suggestions.\nSi, en cours d'exécution, le Gouvernement estime que des modifications fondamentales de ce programme s'avèrent nécessaires, le Premier Ministre soumet lesdites modifications à l'Assemblée Nationale qui peut émettre des suggestions."
                },
                {
                  "id": 100,
                  "title": "Article 100",
                  "content": "Le Premier Ministre, après délibération en Conseil des Ministres, peut engager la responsabilité de son Gouvernement en posant la question de confiance.\nLe vote ne peut avoir lieu que quarante-huit heures après le dépôt de la question. S'il est mis en minorité par les deux tiers des membres composant l'Assemblée Nationale, le Gouvernement remet sa démission au Président de la République.\nLe Président de la République nomme un Premier Ministre conformément à l'article 54."
                },
                {
                  "id": 101,
                  "title": "Article 101",
                  "content": "En début de chaque première session ordinaire, le Gouvernement présente à l'Assemblée Nationale un rapport d'exécution de son programme.\nLa présentation sera suivie d'un débat portant sur les résultats des actions du Gouvernement et l'évaluation des politiques publiques."
                },
                {
                  "id": 102,
                  "title": "Article 102",
                  "content": "Les moyens d'information du Parlement à l'égard de l'action gouvernementale sont la question orale, la question écrite, l'interpellation, et la commission d'enquête.\nUne séance par quinzaine au moins, y compris pendant les sessions extraordinaires prévues à l'article 76, est réservée aux questions des membres du Parlement et aux réponses du Gouvernement.\nTrois jours de séance par mois sont réservés à un ordre du jour arrêté par chaque Assemblée à l'initiative des groupes d'opposition de l'Assemblée intéressée ainsi qu'à celle des groupes minoritaires."
                },
                {
                  "id": 103,
                  "title": "Article 103",
                  "content": "L'Assemblée Nationale peut mettre en cause la responsabilité du Gouvernement par le vote d'une motion de censure.\nUne telle motion n'est recevable que si elle est signée par la moitié des membres composant l'Assemblée Nationale. Le vote ne peut avoir lieu que quarante-huit heures après le dépôt de la motion.\nLa motion n'est adoptée que si elle est votée par les deux tiers des membres composant l'Assemblée Nationale.\nSi la motion est adoptée, le Gouvernement remet sa démission au Président de la République ; il sera procédé à la nomination d'un Premier Ministre dans les conditions prévues à l'article 54 ci-dessus."
                },
                {
                  "id": 104,
                  "title": "Article 104",
                  "content": "Le Parlement, par un vote à la majorité absolue des membres composant chaque Assemblée, peut déléguer son pouvoir de légiférer au Président de la République pendant un temps limité et pour un objet déterminé.\nLa délégation de pouvoir autorise le Président de la République à prendre, par ordonnance en Conseil des Ministres, des mesures de portée générale sur des matières relevant du domaine de la loi."
                }
              ]
            }
          ]
        },
        {
          "title": "Sous-titre III. Du Conseil économique, social et culturel.",
          "articles": [
            {
              "id": 105,
              "title": "Article 105",
              "content": "Le Conseil économique, social et culturel, saisi par le Gouvernement, donne son avis sur les projets de loi, d'ordonnance ou de décret ainsi que sur les propositions de lois qui lui sont soumis.\nIl est compétent pour examiner les projets et propositions de loi à caractère économique, social et culturel à l'exclusion des lois de finances. Il peut entreprendre, de sa propre initiative, toutes études ou enquêtes se rapportant aux questions économique, sociale et culturelle. Ses rapports sont transmis au Président de la République.\nLa composition, les attributions et le fonctionnement du Conseil économique, social, et culturel sont fixés par une loi organique."
            }
          ],
          "chapiters": []
        },
        {
          "title": "Sous-titre IV. Du juridictionnel.",
          "articles": [],
          "chapiters": [
            {
              "title": "Chapitre I. Des principes fondamentaux.",
              "articles": [
                {
                  "id": 106,
                  "title": "Article 106",
                  "content": "Dans la République de Madagascar, la justice est rendue, conformément à la Constitution et à la loi, au nom du Peuple malagasy, par la Cour Suprême, les Cours d’Appel et les juridictions qui leur sont rattachées ainsi que la Haute Cour de Justice."
                },
                {
                  "id": 107,
                  "title": "Article 107",
                  "content": "Le Président de la République est garant de l'indépendance de la justice.\nA cet effet, il est assisté par un Conseil Supérieur de la Magistrature dont il est le Président.\nLe Ministre chargé de la Justice en est le Vice-président.\nLe Conseil Supérieur de la Magistrature, organe de sauvegarde, de gestion de carrière et de sanction des Magistrats, est chargé de :\n- veiller notamment au respect de la loi et des dispositions du statut de la Magistrature,\n- contrôler le respect des règles déontologiques par les Magistrats,\n- présenter des recommandations sur l'administration de la Justice, notamment en ce qui concerne les mesures d’ordre législatif ou réglementaire relatives aux juridictions et aux Magistrats.\nLes membres du Gouvernement, le Parlement, le Haut Conseil pour la Défense de la Démocratie et de l'Etat de droit, les Chefs de Cour ainsi que les associations légalement constituées peuvent saisir le Conseil Supérieur de la Magistrature.\nLes règles relatives à l'organisation, au fonctionnement et aux attributions du Conseil sont fixées par une loi organique."
                },
                {
                  "id": 108,
                  "title": "Article 108",
                  "content": "Dans leurs activités juridictionnelles, les Magistrats du siège, les juges et assesseurs sont indépendants et ne sont soumis qu’à la Constitution et à la loi.\nA ce titre, hors les cas prévus par la loi et sous réserve du pouvoir disciplinaire, ils ne peuvent, en aucune manière, être inquiétés dans l'exercice de leurs fonctions."
                },
                {
                  "id": 109,
                  "title": "Article 109",
                  "content": "Les Magistrats du siège sont inamovibles; ils occupent les postes dont ils sont titulaires en raison de leur grade ; ils ne peuvent recevoir sans leur consentement, aucune affectation nouvelle, sauf nécessité de service dûment constatée par le Conseil Supérieur de la Magistrature."
                },
                {
                  "id": 110,
                  "title": "Article 110",
                  "content": "Les Magistrats du ministère public sont soumis à la subordination hiérarchique ; toutefois, dans leurs conclusions ou réquisitions orales, ils agissent selon leur intime conviction et conformément à la loi. Ils disposent de la police judiciaire dont ils peuvent contrôler les activités et le fonctionnement.\nLe fait de leur enjoindre d’accomplir des actes qui sont manifestement contraires à la loi entraine pour les solliciteurs des sanctions prévues par la loi."
                },
                {
                  "id": 111,
                  "title": "Article 111",
                  "content": "L' exercice des fonctions de Magistrat est incompatible avec toute activité au sein d’un parti politique et du Gouvernement, l'exercice de tout mandat public électif ou de toute autre activité professionnelle rémunérée, à l'exception des activités d’enseignement.\nTout Magistrat en exercice est soumis à l'obligation de neutralité politique.\nTout Magistrat exerçant un mandat public électif est placé d’office en position de détachement."
                },
                {
                  "id": 112,
                  "title": "Article 112",
                  "content": "L' Inspection Générale de la Justice, composée de représentants du Parlement, de représentants du Gouvernement, de représentant du Haut Conseil pour la Défense de la Démocratie et de l'Etat de droit, et de représentants de la Magistrature, est chargée de contrôler le respect des règles déontologiques particulières aux Magistrats, ainsi que les agissements du personnel de la justice.\nElle est rattachée à la Présidence de la République.\nLe Président de la République, le Parlement, le Gouvernement, les Chefs de Cour, les associations légalement constituées et toute personne justifiant d’un intérêt peuvent saisir l'Inspection Générale de la Justice.\nLes règles relatives à l'organisation, au fonctionnement et aux attributions de l'Inspection Générale de la Justice sont fixées par la loi."
                },
                {
                  "id": 113,
                  "title": "Article 113",
                  "content": "Le Conseil National de la Justice, organe consultatif composé du Premier Président de la Cour Suprême, Président, du Procureur général de la Cour Suprême, des Chefs de Cours, de représentants du pouvoir exécutif, du pouvoir législatif, de la Haute Cour Constitutionnelle, du Conseil Supérieur de la Magistrature, du Haut Conseil pour la Défense de la Démocratie et de l'Etat de droit, et des auxiliaires de la justice en général. A ce titre, il peut proposer au Gouvernement des mesures d’ordre législatif ou règlementaire relatives à l'organisation et au fonctionnement des juridictions, au statut des Magistrats et des auxiliaires de la justice.\nLes règles relatives à l'organisation, au fonctionnement et aux attributions du Conseil National de la Justice sont fixées par la loi."
                }
              ]
            },
            {
              "title": "Chapitre II. De la Haute Cour constitutionnelle.",
              "articles": [
                {
                  "id": 114,
                  "title": "Article 114",
                  "content": "La Haute Cour Constitutionnelle comprend neuf membres. Leur mandat est de sept ans non renouvelable.\nTrois des membres sont nommés par le Président de la République, deux sont élus par l'Assemblée nationale, deux par le Sénat, deux sont élus par le Conseil supérieur de la Magistrature.\nLe Président de la Haute Cour Constitutionnelle est élu par et parmi les membres de ladite Cour.\nCette élection ainsi que la désignation des autres membres sont constatées par décret du Président de la République."
                },
                {
                  "id": 115,
                  "title": "Article 115",
                  "content": "Les fonctions de membre de la Haute Cour Constitutionnelle sont incompatibles avec celles de membres du Gouvernement, du Parlement, avec tout mandat public électif, toute autre activité professionnelle rémunérée, à l'exception des activités d'enseignement, ainsi que toute activité au sein d'un parti politique ou d'un syndicat."
                },
                {
                  "id": 116,
                  "title": "Article 116",
                  "content": "Outre les questions qui lui sont renvoyées par d'autres articles de la Constitution, la Haute Cour Constitutionnelle, dans les conditions fixées par une loi organique :\n1. statue sur la conformité à la Constitution des traités, des lois, des ordonnances, et des règlements autonomes;\n2. règle les conflits de compétence entre deux ou plusieurs Institutions de l'Etat ou entre l'Etat et une ou plusieurs Collectivités Territoriales Décentralisées ou entre deux ou plusieurs Collectivités Territoriales Décentralisées;\n3. statue sur la conformité à la Constitution des délibérations et des actes réglementaires adoptés par les Collectivités Territoriales Décentralisées ;\n4. statue sur le contentieux des opérations de référendum, de l'élection du Président de la République et des élections des députés et sénateurs ;\n5. proclame le résultat officiel des élections présidentielles, législatives et des consultations par référendum."
                },
                {
                  "id": 117,
                  "title": "Article 117",
                  "content": "Avant leur promulgation, les lois organiques, les lois et les ordonnances sont soumises obligatoirement par le Président de la République à la Haute Cour Constitutionnelle qui statue sur leur conformité à la Constitution.\nUne disposition jugée inconstitutionnelle ne peut être promulguée. Dans ce cas, le Président de la République peut décider, soit de promulguer les autres dispositions de la loi ou de l'ordonnance, soit de soumettre l'ensemble du texte à une nouvelle délibération du Parlement ou du Conseil des Ministres selon le cas, soit de ne pas procéder à la promulgation.\nDans les cas prévus ci-dessus, la saisine de la Haute Cour Constitutionnelle suspend le délai de promulgation des lois. Le règlement intérieur de chaque Assemblée est soumis au contrôle de constitutionnalité avant sa mise en application. Une disposition jugée inconstitutionnelle ne peut être appliquée."
                },
                {
                  "id": 119,
                  "title": "Article 119",
                  "content": "La Haute Cour Constitutionnelle peut être consultée par tout Chef d'Institution et tout organe des Collectivités Territoriales Décentralisées pour donner son avis sur la constitutionnalité de tout projet d'acte ou sur l'interprétation d'une disposition de la présente Constitution."
                },
                {
                  "id": 119,
                  "title": "Article 119",
                  "content": "La Haute Cour Constitutionnelle peut être consultée par tout Chef d'Institution et tout organe des Collectivités Territoriales Décentralisées pour donner son avis sur la constitutionnalité de tout projet d'acte ou sur l'interprétation d'une disposition de la présente Constitution."
                },
                {
                  "id": 120,
                  "title": "Article 120",
                  "content": "En matière de contentieux électoral et de consultation populaire directe, la Haute Cour Constitutionnelle rend des arrêts.\nDans les autres matières relevant de sa compétence, hors le cas prévu à l'article 119, elle rend des décisions.\nLes arrêts et décisions de la Haute Cour Constitutionnelle sont motivés ; ils ne sont susceptibles d'aucun recours. Ils s'imposent à tous les pouvoirs publics ainsi qu'aux autorités administratives et juridictionnelles."
                }
              ]
            },
            {
              "title": "Chapitre III. De la Cour suprême.",
              "articles": [
                {
                  "id": 121,
                  "title": "Article 121",
                  "content": "La Cour Suprême veille au fonctionnement régulier des juridictions de l'ordre judiciaire, administratif et financier.\nElle comprend :\n- la Cour de Cassation ;\n- le Conseil d'Etat ;\n- la Cour des Comptes."
                },
                {
                  "id": 122,
                  "title": "Article 122",
                  "content": "Le Premier Président et le Procureur Général de la Cour Suprême sont les chefs de cette haute juridiction.\nIls sont respectivement nommés par décret pris en Conseil des Ministres conformément aux propositions du Conseil Supérieur de la Magistrature de préférence parmi les plus anciens dans le grade le plus élevé des Magistrats respectivement de l'ordre judiciaire, administratif et financier."
                },
                {
                  "id": 123,
                  "title": "Article 123",
                  "content": "Le Premier Président de la Cour Suprême est secondé par trois Viceprésidents, affectés respectivement à la présidence de la Cour de Cassation, du Conseil d'Etat et de la Cour des Comptes.\nChaque Vice-président est nommé en Conseil des Ministres par décret du Président de la République conformément aux propositions du Conseil Supérieur de la Magistrature, de préférence parmi les plus anciens dans le grade le plus élevé des Magistrats respectivement de l'ordre judiciaire, administratif et financier."
                },
                {
                  "id": 124,
                  "title": "Article 124",
                  "content": "Le Parquet général de la Cour Suprême comprend :\n- un Parquet général de la Cour de cassation ;\n- un Commissariat général de la loi pour le Conseil d'Etat ;\n- un Commissariat général du Trésor public pour la Cour des Comptes.\nLe Procureur général de la Cour Suprême est secondé par les trois chefs de ces Parquets généraux.\nLe chef du Parquet général de la Cour de Cassation, du Commissariat Général de la loi ou du Commissariat général du Trésor public est nommé en Conseil des Ministres conformément aux propositions du Conseil Supérieur de la Magistrature, de préférence parmi les Magistrats les plus anciens dans le grade le plus élevé respectivement de l'ordre Judiciaire, administratif et financier."
                },
                {
                  "id": 125,
                  "title": "Article 125",
                  "content": "Outre les attributions qui lui sont dévolues par des lois particulières, la Cour Suprême règle les conflits de compétence entre deux juridictions d'ordre différent."
                },
                {
                  "id": 126,
                  "title": "Article 126",
                  "content": "La Cour de Cassation veille à l'application de la loi par les juridictions de l'ordre judiciaire.\nOutre les compétences qui lui sont reconnues par les lois particulières, elle statue sur les pourvois en cassation formés contre les décisions rendues en dernier ressort par ces juridictions."
                },
                {
                  "id": 127,
                  "title": "Article 127",
                  "content": "Sans préjudice de compétences et dispositions spéciales prévues par la loi, le Conseil d'Etat contrôle la régularité des actes de l'Administration et veille à l'application de la loi par les juridictions de l'ordre administratif.\nLe Conseil d'Etat, dans les conditions fixées par une loi organique :\n1. juge les recours en annulation des actes des autorités administratives centrales, les recours de pleine juridiction pour les faits dommageables occasionnés par les activités de l'Administration, les réclamations contentieuses en matière fiscale ;\n2. connaît en appel du contrôle de la légalité des actes des autorités des Collectivités Territoriales Décentralisées ;\n3. statue en appel ou en cassation sur les décisions rendues par les tribunaux administratifs ou les juridictions administratives spécialisées.\nIl est juge de certains contentieux électoraux.\nIl peut être consulté par le Premier Ministre et par les membres du gouvernement pour donner son avis sur les projets de texte législatif, réglementaire, ou sur l'interprétation d'une disposition législative, réglementaire.\nIl peut procéder, à la demande du Premier Ministre, à des études sur des textes de lois, sur l'organisation, le fonctionnement, et les missions des services publics."
                },
                {
                  "id": 128,
                  "title": "Article 128",
                  "content": "La Cour des Comptes :\n1. juge les comptes des comptables publics ;\n2. contrôle l'exécution des lois de finances et des budgets des organismes publics ;\n3. contrôle les comptes et la gestion des entreprises publiques ;\n4. statue en appel des jugements rendus en matière financière par les juridictions ou les organismes administratifs à caractère juridictionnel ;\n5. assiste le Parlement et le Gouvernement dans le contrôle de l'exécution des lois de finances."
                },
                {
                  "id": 129,
                  "title": "Article 129",
                  "content": "La Cour Suprême adresse un rapport annuel de ses activités au Président de la République, au Premier Ministre, aux Présidents des deux Assemblées et au Ministre chargé de la Justice et au Conseil Supérieur de la Magistrature.\nCe rapport doit être publié au Journal officiel dans l'année qui suit la clôture de l'année judiciaire concernée."
                },
                {
                  "id": 130,
                  "title": "Article 130",
                  "content": "Le Premier Président, le Procureur général des Cours d’appel sont nommés en Conseil des Ministres par décret du Président de la République conformément aux propositions du Conseil Supérieur de la Magistrature, de préférence parmi les plus anciens dans le grade le plus élevé des Magistrats respectivement de l'ordre judiciaire, administratif et financier."
                }
              ]
            },
            {
              "title": "Chapitre IV. De la Haute Cour de justice.",
              "articles": [
                {
                  "id": 131,
                  "title": "Article 131",
                  "content": "Le Président de la République n'est responsable des actes accomplis liés à l'exercice de ses fonctions qu'en cas de haute trahison, de violation grave, ou de violations répétées de la Constitution, de manquement à ses devoirs manifestement incompatible avec l'exercice de son mandat.\nIl ne peut être mis en accusation que par l'Assemblée Nationale au scrutin public et à la majorité des deux tiers de ses membres.\nIl est justiciable devant la Haute Cour de Justice. La mise en accusation peut aboutir à la déchéance de son mandat."
                },
                {
                  "id": 132,
                  "title": "Article 132",
                  "content": "Si la déchéance du Président de la République est prononcée, la Haute Cour Constitutionnelle constate la vacance de la Présidence de la République ; il sera procédé à l'élection d'un nouveau Président dans les conditions de l'article 47 ci-dessus. Le Président frappé de déchéance n'est plus éligible à toute fonction publique élective."
                },
                {
                  "id": 133,
                  "title": "Article 133",
                  "content": "Les Présidents des Assemblées parlementaires, le Premier Ministre, les autres membres du Gouvernement et le Président de la Haute Cour Constitutionnelle sont pénalement responsables, devant la Haute Cour de Justice, des actes accomplis liés à l'exercice de leurs fonctions des actes qualifiés de crimes ou délits au moment où ils ont été commis.\nIls peuvent être mis en accusation par l'Assemblée Nationale statuant au scrutin public à la majorité absolue de ses membres.\nL' initiative de la poursuite émane du Procureur Général de la Cour Suprême."
                },
                {
                  "id": 134,
                  "title": "Article 134",
                  "content": "Les Présidents des Assemblées parlementaires, le Premier Ministre, les autres membres du Gouvernement et le Président de la Haute Cour Constitutionnelle sont justiciables des juridictions de droit commun pour les infractions commises hors de l'exercice de leurs fonctions.\nL'initiative des poursuites émane du Procureur Général près la Cour de Cassation.\nDans ce cas, lorsqu'il y a délit, la juridiction correctionnelle compétente est présidée par le Président du tribunal ou par un vice-président s'il en est empêché.\nLes dispositions des trois alinéas précédents sont également applicables aux députés, aux sénateurs et aux membres de la Haute Cour Constitutionnelle."
                },
                {
                  "id": 135,
                  "title": "Article 135",
                  "content": "La Haute Cour de Justice jouit de la plénitude de juridiction."
                },
                {
                  "id": 136,
                  "title": "Article 136",
                  "content": "La Haute Cour de Justice est composée de onze membres dont :\n1. le Premier Président de la Cour Suprême, Président, suppléé de plein droit, en cas d'empêchement, par le Président de la Cour de Cassation;\n2. deux Présidents de Chambre de la Cour de la Cassation, et deux suppléants, désignés par l'Assemblée générale de ladite Cour ;\n3. deux premiers Présidents de Cour d'Appel, et deux suppléants, désignés par le Premier Président de la Cour Suprême ;\n4. deux députés titulaires et deux députés suppléants élus en début de législature par l'Assemblée nationale ;\n5. deux sénateurs titulaires et deux sénateurs suppléants, élus en début de législature par le Sénat.\n6. deux membres titulaires et deux membres suppléants issus du Haut Conseil pour la Défense de la Démocratie et de l'Etat de droit.\nLe ministère public est représenté par le Procureur Général de la Cour Suprême assisté d'un ou plusieurs membres de son parquet général. En cas d'empêchement du Procureur Général, il est suppléé par le Procureur Général de la Cour de Cassation.\nLe greffier en chef de la Cour Suprême est de droit greffier de la Haute Cour de Justice. Il y tient la plume. En cas d'empêchement, il est remplacé par le greffier en chef de la Cour de Cassation.\nL' organisation et la procédure à suivre devant la Haute Cour de Justice sont fixées par une loi organique."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Titre IV.Des traités et accords internationaux.",
      "range": "Art.137-Art.138",
      "articles": [
        {
          "id": 137,
          "title": "Article 137",
          "content": "Le Président de la République négocie et ratifie les traités. Il est informé de toute négociation tendant à la conclusion d'un accord international non soumis à ratification.\nLa ratification ou l'approbation de traités d'alliance, de traités de commerce, de traités ou d'accord relatif à l'organisation internationale, de ceux qui engagent les finances de l'Etat y compris les emprunts extérieurs, et de ceux qui modifient les dispositions de nature législative, de ceux qui sont relatifs à l'état des personnes, des traités de paix, de ceux qui comportent modification de territoire, doit être autorisée par la loi.\nAvant toute ratification, les traités sont soumis par le Président de la République, au contrôle de constitutionnalité de la Haute Cour Constitutionnelle.\nEn cas de non conformité à la Constitution, il ne peut y avoir ratification qu'après révision de celle-ci.\nLes traités ou accords régulièrement ratifiés ou approuvés ont, dès leur publication, une autorité supérieure à celle des lois, sous réserve, pour chaque accord ou traité, de son application par l'autre partie.\nTout traité d’appartenance de Madagascar à une organisation d’intégration régionale doit être soumis à une consultation populaire par voie de référendum."
        },
        {
          "id": 138,
          "title": "Article 138",
          "content": "Le Premier Ministre négocie et signe les accords internationaux non soumis à ratification."
        }
      ],
      "subtitles": []
    },
    {
      "title": "Titre V. De l'organisation territoriale de l'État",
      "range": "Art.139-Art.160",
      "articles": [],
      "subtitles": [
        {
          "title": "Sous-titre I : Des dispositions générales",
          "articles": [
            {
              "id": 139,
              "title": "Article 139",
              "content": "Les collectivités territoriales décentralisées, dotées de la personnalité morale et de l'autonomie administrative et financière, constituent le cadre institutionnel de la participation effective des citoyens à la gestion des affaires publiques et garantissent l'expression de leurs diversités et de leurs spécificités.\nElles possèdent un patrimoine comprenant un domaine public et un domaine privé qui sont délimités par la loi.\nLes terres vacantes et sans maître font partie du domaine de l'Etat."
            },
            {
              "id": 140,
              "title": "Article 140",
              "content": "Les Collectivités Territoriales Décentralisées disposent d’un pouvoir règlementaire.\nL' Etat veille à ce que le règlement d’une Collectivité Territoriale décentralisée n’affecte pas les intérêts d’une autre Collectivité Territoriale Décentralisée.\nL' Etat veille au développement harmonieux de toutes les Collectivités Territoriales décentralisées sur la base de la solidarité nationale, des potentialités régionales et de l'équilibre interrégional par des dispositifs de péréquation.\nDes mesures spéciales seront prises en faveur du développement des zones les moins avancées, y compris la constitution d’un fonds spécial de solidarité."
            },
            {
              "id": 141,
              "title": "Article 141",
              "content": "Les Collectivités Territoriales décentralisées assurent avec le concours de l'Etat, notamment la sécurité publique, la défense civile, l'administration, l'aménagement du territoire, le développement économique, la préservation de l'environnement et l'amélioration du cadre de vie.\nDans ces domaines, la loi détermine la répartition des compétences en considération des intérêts nationaux et des intérêts locaux."
            },
            {
              "id": 142,
              "title": "Article 142",
              "content": "Les Collectivités Territoriales décentralisées jouissent de l'autonomie financière.\nElles élaborent et gèrent leur budget selon les principes applicables en matière de gestion des finances publiques.\nLes budgets des Collectivités Territoriales décentralisées bénéficient de ressources de diverses natures."
            },
            {
              "id": 143,
              "title": "Article 143",
              "content": "Les Collectivités Territoriales décentralisées de la République sont les Communes, les Régions et les Provinces.\nLa création et la délimitation des Collectivités Territoriales décentralisées doivent répondre à des critères d’homogénéité géographique, économique, sociale et culturelle. Elles sont décidées par la loi."
            },
            {
              "id": 144,
              "title": "Article 144",
              "content": "Les Collectivités Territoriales décentralisées s’administrent librement par des assemblées qui règlent, par leurs délibérations, les affaires dévolues à leur compétence par la présente Constitution et par la loi.\nCes délibérations ne peuvent pas être contraires aux dispositions constitutionnelles, législatives, et règlementaires."
            },
            {
              "id": 145,
              "title": "Article 145",
              "content": "La représentation de l'Etat auprès des Collectivités Territoriales Décentralisées est régie par la loi."
            },
            {
              "id": 146,
              "title": "Article 146",
              "content": "L' Etat s’engage à mettre en oeuvre les mesures suivantes :\n- répartition des compétences entre l'Etat et les collectivités territoriales décentralisées ;\n- répartition des ressources entre l'Etat et les collectivités territoriales décentralisées ;\n- répartition des services publics entre l'Etat et les collectivités territoriales décentralisées."
            },
            {
              "id": 147,
              "title": "Article 147",
              "content": "Les ressources d’une collectivité territoriale décentralisée comprennent notamment:\n- le produit des impôts et taxes votés par son Conseil et perçus directement au profit du budget de la Collectivité Territoriale Décentralisée ; la loi détermine la nature et le taux maximum de ces impôts et taxes en tenant dûment compte des charges assumées par les Collectivités Territoriales Décentralisées et de la charge fiscale globale imposée à la Nation ;\n- la part qui lui revient de droit sur le produit des impôts et taxes perçus au profit du budget de l'Etat ; cette part qui est prélevée automatiquement au moment de la perception est déterminée par la loi suivant un pourcentage qui tient compte des charges assumés globalement et individuellement par les Collectivités Territoriales Décentralisées et assurer un développement économique et social équilibré entre toutes les Collectivités Territoriales Décentralisées sur l'ensemble du territoire national ;\n- le produit des subventions affectées ou non affectées consenties par le budget de l'Etat à l'ensemble ou à chacune des Collectivités Territoriales Décentralisées pour tenir compte de leur situation particulière, ou pour compenser, pour ces Collectivités Territoriales Décentralisées, les charges entraînées par des programmes ou projets décidés par l'Etat mis en oeuvre par les Collectivités Territoriales Décentralisées ;\n- le produit des aides extérieures non remboursables et le produit des dons à la collectivité territoriale décentralisée ;\n- les revenus de leur patrimoine ;\n- les emprunts dont les conditions de souscription sont fixées par la loi."
            }
          ],
          "chapiters": []
        },
        {
          "title": "Sous-titre II. Des structures.",
          "articles": [],
          "chapiters": [
            {
              "title": "Chapitre I. Des communes.",
              "articles": [
                {
                  "id": 148,
                  "title": "Article 148",
                  "content": "Les communes constituent les collectivités territoriales décentralisées de base. Les communes sont urbaines ou rurales en considération de leur assiette démographique réduite ou non à une agglomération urbanisée."
                },
                {
                  "id": 149,
                  "title": "Article 149",
                  "content": "Les communes concourent au développement économique, social, culturel et environnemental de leur ressort territorial. Leurs compétences tiennent compte essentiellement des principes constitutionnels et légaux ainsi que du principe de proximité, de promotion et de défense des intérêts des habitants."
                },
                {
                  "id": 150,
                  "title": "Article 150",
                  "content": "Les communes peuvent se constituer en groupement pour la réalisation de projets de développement commun."
                },
                {
                  "id": 151,
                  "title": "Article 151",
                  "content": "Dans les communes, les fonctions exécutives et délibérantes sont exercées par des organes distincts et élus au suffrage universel direct.\nLa composition, l'organisation, les attributions et le fonctionnement des organes exécutifs et délibérants ainsi que le mode et les conditions d’élection de ses membres sont fixés par la loi."
                },
                {
                  "id": 152,
                  "title": "Article 152",
                  "content": "Le Fokonolona, organisé en fokontany au sein des communes, est la base du développement et de la cohésion socio-culturelle et environnementale.\nLes responsables des fokontany participent à l'élaboration du programme de développement de leur commune."
                }
              ]
            },
            {
              "title": "Chapitre II. Des régions.",
              "articles": [
                {
                  "id": 153,
                  "title": "Article 153",
                  "content": "Les régions ont une vocation essentiellement économique et sociale.\nEn collaboration avec les organismes publics et privés, elles dirigent, dynamisent, coordonnent et harmonisent le développement économique et social de l'ensemble de leur ressort territorial et assurent la planification, l'aménagement du territoire et la mise en oeuvre de toutes les actions de développement."
                },
                {
                  "id": 154,
                  "title": "Article 154",
                  "content": "La fonction exécutive est exercée par un organe dirigé par le Chef de Région élu au suffrage universel.\nLe Chef de Région est le premier responsable de la stratégie et de la mise en oeuvre de toutes les actions de développement économique et social de sa région.\nIl est le Chef de l'Administration de sa région."
                },
                {
                  "id": 155,
                  "title": "Article 155",
                  "content": "La fonction délibérante est exercée par le Conseil régional dont les membres sont élus au suffrage universel.\nLes députés et les sénateurs issus des différentes circonscriptions de la région sont membres de droit du Conseil régional, avec voix délibérative."
                },
                {
                  "id": 156,
                  "title": "Article 156",
                  "content": "La composition, l'organisation, les attributions et le fonctionnement des organes exécutifs et délibérants ainsi que le mode et les conditions d’élection de ses membres sont fixés par la loi."
                }
              ]
            },
            {
              "title": "Chapitre III. Des provinces.",
              "articles": [
                {
                  "id": 157,
                  "title": "Article 157",
                  "content": "Les Provinces sont des collectivités territoriales décentralisées dotées de la personnalité morale, de l'autonomie administrative et financière.\nElles assurent la coordination et l'harmonisation des actions de développement d’intérêt provincial et veillent au développement équitable et harmonieux des collectivités territoriales décentralisées dans la province.\nLes provinces mettent en oeuvre la politique de développement d’intérêt provincial défini et arrêté en conseil provincial.\nEn collaboration avec les organismes publics et privés, elles dirigent, dynamisent, coordonnent et harmonisent le développement économique et social de l'ensemble de la province et assurent, à ce titre, la planification, l'aménagement du territoire et la mise en oeuvre de toutes les actions de développement."
                },
                {
                  "id": 158,
                  "title": "Article 158",
                  "content": "La fonction exécutive est exercée par un organe dirigé par le Chef de Province élu au suffrage universel.\nLe Chef de Province est le premier responsable de la stratégie et de la mise en oeuvre de toutes les actions de développement économique et social de sa province.\nIl est le Chef de l'Administration de la province."
                },
                {
                  "id": 159,
                  "title": "Article 159",
                  "content": "La fonction délibérante est exercée par le conseil provincial dont les membres sont élus au suffrage universel.\nLes députés et les sénateurs issus des différentes circonscriptions de la province sont membres de droit du Conseil provincial, avec voix délibérative."
                },
                {
                  "id": 160,
                  "title": "Article 160",
                  "content": "La composition, l'organisation, les attributions et le fonctionnement de ces organes exécutif et délibérant, ainsi que le mode et les conditions d’élection de leurs membres sont fixés par la loi."
                }
              ]
            }
          ]
        }
      ]
    },
    {
      "title": "Titre VI. De la révision de la Constitution.",
      "range": "Art.161-Art.163",
      "articles": [
        {
          "id": 161,
          "title": "Article 161",
          "content": "Aucune révision de la Constitution ne peut être initiée, sauf en cas de nécessité jugée impérieuse."
        },
        {
          "id": 162,
          "title": "Article 162",
          "content": "L'initiative de la révision, en cas de nécessité jugée impérieuse, appartient soit au Président de la République qui statue en Conseil des Ministres, soit aux Assemblées parlementaires statuant par un vote séparé à la majorité des deux tiers des membres.\nLe projet ou proposition de révision doit être approuvé(e) par les trois quarts des membres de l'Assemblée Nationale et du Sénat.\nLe projet ou la proposition de révision ainsi approuvé(e) est soumis à référendum."
        },
        {
          "id": 163,
          "title": "Article 163",
          "content": "La forme républicaine de l'Etat, le principe de l'intégrité du territoire national, le principe de la séparation des pouvoirs, le principe d’autonomie des Collectivités Territoriales Décentralisées, la durée et le nombre du mandat du Président de la République, ne peuvent faire l'objet de révision.\nLes pouvoirs exceptionnels détenus par le Président de la République dans les circonstances exceptionnelles ou de trouble politique ne lui confèrent pas le droit de recourir à une révision constitutionnelle."
        }
      ],
      "subtitles": []
    },
    {
      "title": "Titre VII. Dispositions transitoires et diverses.",
      "range": "Art.164-Art.168",
      "articles": [
        {
          "id": 164,
          "title": "Article 164",
          "content": "La présente Constitution sera adoptée par référendum. Elle entrera en vigueur dès sa promulgation par le Président de la Haute Autorité de la Transition, dans les dix jours suivant la proclamation des résultats définitifs du référendum par la Haute Cour Constitutionnelle."
        },
        {
          "id": 165,
          "title": "Article 165",
          "content": "La législation en vigueur demeure applicable en toutes ses dispositions non contraires à la présente Constitution.\nLes textes à caractère législatifs relatifs à la mise en place des institutions et organes, ainsi que les autres lois d’application prévus par la présente Constitution seront pris par voie d’ordonnances."
        },
        {
          "id": 166,
          "title": "Article 166",
          "content": "Jusqu’à la mise en place progressive des Institutions prévues par la présente Constitution, les Institutions et les organes prévus pour la période de la Transition continuent d’exercer leurs fonctions.\nLe Conseil Supérieur de la Transition et le Congrès de la Transition cesse leurs fonctions dès l'élection du bureau de la nouvelle Assemblée Nationale.\nEn attendant la mise en place du Sénat, l'Assemblée Nationale a la plénitude du pouvoir législatif.\nJusqu’à l'investiture du nouveau Président de la République, l'actuel Président de la Haute Autorité de la Transition continue d’exercer les fonctions de Chef de l'Etat.\nEn cas de vacance de la Présidence, pour quelque cause que ce soit, les fonctions de Chef de l'Etat sont exercées collégialement par le Premier Ministre, le Président du Conseil Supérieur de la Transition, et le Président du Congrès."
        },
        {
          "id": 167,
          "title": "Article 167",
          "content": "Afin de respecter le prescrit constitutionnel, le Président de la République, dans un délai de 12 mois à compter de son investiture, invite les Instances compétentes à désigner les membres qui composeront la Haute Cour de Justice afin de procéder dès l'expiration de ce délai à l'installation de la Haute Cour de Justice. Toute partie justifiant d’un intérêt peut saisir les institutions compétentes de demande de sanction en cas de carence.\nEn ce qui concerne le Président de la République, exceptionnellement, l'Instance compétente est la Haute Cour Constitutionnelle qui serait autorisée à prendre les sanctions qu’aurait pu prendre la Haute Cour de Justice si elle était installée."
        },
        {
          "id": 168,
          "title": "Article 168",
          "content": "Dans le cadre du processus de réconciliation nationale, il est institué un Conseil du Fampihavanana Malagasy dont la composition, les attributions, et les modalités de fonctionnement sont déterminées par la loi."
        }
      ],
      "subtitles": []
    }
  ]
}